---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTrayType.IsValidBendMultiplier(System.Double)
source: html/e5a6d9f0-b8ee-bd35-312e-1c2061b4733f.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayType.IsValidBendMultiplier Method

Identifies if the input bend multiplier is valid.

## Syntax (C#)
```csharp
public bool IsValidBendMultiplier(
	double bendMultiplier
)
```

## Parameters
- **bendMultiplier** (`System.Double`) - The bend multiplier to check.

## Returns
True if the value is acceptable, false otherwise.